---
kind: other
id: Methods.T:Autodesk.Revit.DB.GlobalParameter
source: html/3e2f5a5a-84bd-40a7-b1cc-371dbb448896.htm
---
# GlobalParameter Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.